/*:
@target MV MZ
@plugindesc スキルツリーコンフィグ v1.0.1
@author うなぎおおとろ
@url https://raw.githubusercontent.com/unagiootoro/RPGMZ/master/SkillTreeConfig.js

@help
[概要]
スキルツリーを導入するプラグインです。
SPを使ってスキルを習得するスキルツリーを作成することができます。

[使用方法]
■ スキルツリーの設定
スキルツリーの設定は、「SkillTreeConfig.js」ファイルを編集することで行います。
基本的な設定としては、アクターごとにスキルツリーのタイプ(剣スキルや魔法スキルなど)を設定し、
そしてタイプごとにスキルツリーを構築します。
スキルツリーの構築は、スキルの派生設定(ファイアⅠを取得したらファイアⅡが取得可能になるなど)によって行います。

■ SPの入手設定
スキルの習得には、SPが必要となります。
SPの入手方法としては
・戦闘終了による獲得
・レベルアップによるSP獲得
の二通りの設定を行うことができます。

・戦闘終了時に得られるSPの設定方法
敵キャラのメモ欄に
<battleEndGainSp: SP>
の形式で記載します。

・レベルアップによるSP獲得方法の設定
コンフィグの「levelUpGainSp」によって設定を行います。

■ イベントでSPを獲得する方法
スクリプトで
skt_gainSp(アクターID, 獲得するSP値)
と記載することで、該当のアクターが指定したSPを獲得することができます。
例えば、アクターIDが1のアクターが5SPを獲得する場合、
skt_gainSp(1, 5);
と記載します。

■ 割り振った累計SPの取得
skt_totalSp(アクターID, 累計SP格納先変数ID)
と記載することで、該当のアクターが今までに割り振ったSPを指定した変数に代入することができます。
例えば、アクターIDが1のアクターの累計SPをID2の変数に代入する場合、
skt_totalSp(1, 2);
と記載します。

■ スキルリセット
スクリプトで
skt_skillReset(アクターID);
と記載することで、一度習得したスキルをリセットすることができます。
例えば、アクターIDが1のアクターのスキルリセットを行う場合、
skt_skillReset(1);
と記載します。

■ スキルツリータイプの有効/無効
スクリプトで
skt_enableType(アクターID, "タイプ名");
と記載することで、タイプを有効にします。

無効にする場合は、
skt_disableType(アクターID, "タイプ名")
と記載します。

無効にしたタイプは、スキルツリーのタイプ一覧には表示されません。

■ タイプの引継ぎ
特定の条件を満たすとスキルツリーに新たなスキルが追加されるようにしたい場合、「タイプの引継ぎ」を使用します。
例えば、タイプ「下位魔法」を「上位魔法」に変更したい場合、あらかじめ両方のタイプをコンフィグに登録した上で、
「上位魔法」は無効化しておきます。そして、タイプの引継ぎ機能を用いて、「下位魔法」を「上位魔法」に引き継がせます。

タイプの引継ぎを行う場合、スクリプトで
skt_migrationType(アクターID, "引継ぎ元タイプ名", "引継ぎ先タイプ名", リセット有無);
と記載します。リセット有無については、引継ぎ後、引継ぎ元のタイプのスキルツリーをリセットする場合、trueを、
リセットしない場合、falseを指定します。
例えば、アクターIDが1のアクターが、タイプ「下位魔法」を「上位魔法」に引き継がせ、さらにスキルリセットを行う場合、
skt_migrationType(アクターID, "下位魔法", "上位魔法", true);
と記載します。

■ マップからスキルツリーを読み込む
マップからスキルツリーの各スキルの配置座標を読み込むことで、ある程度自由なレイアウトのスキルツリーを
作成することができます。この機能によって設定可能なのはスキルの座標のみであり、スキル間の線はプラグイン側で描画します。

・スキル座標の設定
マップ上のイベントにて、設定を行います。
例えば、"ファイア"というスキルがある場合、スキルを配置したい座標に空のイベントを作成し、
イベントのメモ欄に
ファイア
と記載します。すると、"ファイア"とメモ欄に記載したイベントのXY座標がスキルのXY座標として使用されます。

■ スクリプトからスキルツリーを起動
スクリプトで
skt_open(アクターID);
と記載することで、指定したアクターのスキルツリーを起動することができます。

■ スクリプトからスキルツリーのスキルを取得する
スクリプトで
skt_learn(アクターID, "タイプ名", スキル名, 強制取得有無(省略可));
と記載することで、指定したスキルを取得することができます。
スキル名は「skillTreeInfo」で指定したものを使用してください。
強制取得有無にtrueを設定した場合、習得可能か否かの判定を無視して強制的にスキルを取得します。
また、この場合SPは消費されません。
強制取得有無にfalseを設定した場合は通常通りの方法でスキルを取得します。この場合はSPも消費されます。
なおこの項目については省略可能です。省略した場合はfalseが適用されます。
例: アクターID1のキャラクターで、タイプ「剣技」のスキルツリーの「強撃」を取得する場合
skt_learn(1, "剣技", "強撃", false);
*/

const loadSkillTreeConfig = () => {
return {
// =============================================================
// ●ここからは設定項目です。
// =============================================================

// スキルツリーのタイプの設定を行います。
// skillTreeTypes: [ ～ ]の中にアクターの数だけタイプ設定を追加します。

// タイプ設定は、次の形式で設定します。
// { actorId: アクターのID, types: [タイプ情報1, タイプ情報2, ...] }

// タイプ情報は、次の形式で設定します。
// [タイプ種別, タイプ名, タイプの説明, タイプ有効/無効]
// タイプ種別...スキルの派生設定でタイプを識別するためのユニークな識別子を設定します。
// タイプ名...タイプ一覧のウィンドウに表示するタイプ名を設定します。
// タイプの説明...タイプ一覧のウィンドウに表示するタイプの説明を設定します。
// タイプ有効/無効...タイプを有効にする場合は、trueを、無効にする場合は、falseを指定します。
//                  この項目については、省略可能です。省略した場合、trueが指定されます。
skillTreeTypes: [
    {
        actorId: 2,
        types: [
            ["魔法(炎)", "魔法(炎)", "魔法(炎)を取得します。", true, 64],
        ]
    },

    {
        actorId: 3,
        types: [
            ["魔法(風)", "魔法(風)", "魔法(風)を取得します。", true, 69],
        ]
    },

    {
        actorId: 4,
        types: [
            ["魔法(氷)", "魔法(氷)", "魔法(氷)を取得します。", true, 65],
        ]
    },

    {
        actorId: 5,
        types: [
            ["格闘", "格闘", "格闘を取得します。", true, 77],
        ]
    },

    {
        actorId: 6,
        types: [
            ["魔法(光)", "魔法(光)", "魔法(光)を取得します。", true, 70],
        ]
    },
],

// スキルツリーのマップ読み込み設定を行います。
// 読み込むマップは以下の形式で指定します。
// skillTreeMapId: { skillTreeName1: mapID1, skillTreeName2: mapID2, ... }
// skillTreeName...スキルツリーのタイプ名を指定します。
// mapID...読み込むマップIDを指定します。0の場合は読み込みを行いません。
skillTreeMapId: {
    "魔法(炎)": 53,
    "魔法(風)": 54,
    "魔法(氷)": 55,
    "格闘": 56,
    "魔法(光)": 57,
},

// 各スキルの情報を登録します。
// skillTreeInfo: [ ～ ]の中に登録するスキル数分のスキル情報の登録を行います。

// スキル情報の登録は次の形式で行います。
// [スキル名, スキルID, 必要SP, アイコン情報]
// スキル名...スキルツリーの派生設定でスキルを一意に識別するための識別子
//            識別子なので、実際のスキル名と一致していなくても問題はありません。
// スキルID...データベース上で該当するスキルのID
// 必要SP...スキルの習得に必要なSP
// アイコン情報については、アイコンを使用するか、任意の画像を使用するかに応じて次の形式で登録します。
//   アイコンを使用する場合 ["icon", iconIndex]
//   iconIndex...使用するアイコンのインデックス
//               iconIndexは省略可能です。省略した場合、スキルに設定されているアイコンが使用されます。
//   画像を使用する場合 ["img", fileName]
//   fileName...画像のファイル名。画像は、「img/pictures」フォルダにインポートしてください。
// なお、アイコン情報については省略可能です。省略した場合、["icon"]が適用されます。
skillTreeInfo: [
    // 魔法(炎)
    ["ファストマジック(炎)", 22, 1],
    ["ファイアⅠ", 23, 3],
    ["ファイアⅡ", 24, 4],
    ["ファイアⅢ", 25, 5],
    ["フレイムサイクロンⅠ", 26, 3],
    ["フレイムサイクロンⅡ", 27, 4],
    ["ブレイズⅠ", 29, 3],
    ["ブレイズⅡ", 30, 4],
    ["ブレイズⅢ", 31, 5],
    ["バーンⅠ", 32, 3],
    ["バーンⅡ", 33, 4],
    ["バーンⅢ", 34, 5],
    ["ヒートアップⅠ", 35, 3],
    ["ヒートアップⅡ", 36, 4],
    ["ヒートアップⅢ", 37, 5],
    ["火魔女Ⅰ", 38, 3],
    ["火魔女Ⅱ", 39, 4],
    ["火魔女Ⅲ", 40, 5],
    ["炎の魔女", 41, 10],
    ["メテオインパクト", 42, 10],
    ["カオスインフェルノ", 43, 12],

    // 魔法(風)
    ["ファストマジック(風)", 172, 0],
    ["ウィンドⅠ", 173, 3],
    ["ウィンドⅡ", 174, 4],
    ["ウィンドⅢ", 175, 5],
    ["エアスラッシュⅠ", 176, 3],
    ["エアスラッシュⅡ", 177, 4],
    ["エアリアルダンス", 185, 3],
    ["ウィンドブースト", 186, 4],
    ["ストームⅠ", 182, 3],
    ["ストームⅡ", 183, 4],
    ["ストームⅢ", 184, 5],
    ["アースシールドⅠ", 149, 3],
    ["アースシールドⅡ", 150, 4],
    ["アースシールドⅢ", 151, 5],
    ["ストーンウォール", 155, 5],
    ["鉄の処女Ⅰ", 158, 3],
    ["鉄の処女Ⅱ", 159, 4],
    ["鉄の処女Ⅲ", 160, 5],
    ["壁の魔女", 161, 10],
    ["サイクロン", 192, 10],
    ["テンペスト", 193, 12],

    // 魔法(氷)
    ["ファストマジック(氷)", 52, 0],
    ["アイスⅠ", 53, 3],
    ["アイスⅡ", 54, 4],
    ["アイスⅢ", 55, 5],
    ["ブリザードⅠ", 56, 3],
    ["ブリザードⅡ", 57, 4],
    ["ブリザードⅢ", 58, 4],
    ["ダイヤモンドダストⅠ", 59, 3],
    ["ダイヤモンドダストⅡ", 60, 4],
    ["ダイヤモンドダストⅢ", 61, 5],
    ["アイスフィールドⅠ", 62, 3],
    ["アイスフィールドⅡ", 63, 4],
    ["アイスフィールドⅢ", 64, 5],
    ["フロスト", 65, 3],
    ["アイスミラー", 66, 4],
    ["氷魔の印Ⅰ", 68, 3],
    ["氷魔の印Ⅱ", 69, 4],
    ["氷魔の印Ⅲ", 70, 5],
    ["氷の魔女", 71, 10],
    ["ブリザードストーム", 72, 10],
    ["アブソリュートゼロ", 73, 12],

    // 格闘
    ["体当たり", 342, 0],
    ["ひっかくⅠ", 343, 3],
    ["ひっかくⅡ", 344, 4],
    ["ひっかくⅢ", 345, 5],
    ["猛猫乱舞Ⅰ", 346, 3],
    ["猛猫乱舞Ⅱ", 347, 4],
    ["猛猫乱舞Ⅲ", 348, 4],
    ["気合いⅠ", 349, 3],
    ["気合いⅡ", 350, 4],
    ["闘志", 351, 5],
    ["とっしんⅠ", 354, 3],
    ["とっしんⅡ", 355, 4],
    ["とっしんⅢ", 356, 5],
    ["一喝", 352, 3],
    ["かばう", 353, 4],
    ["猫まんまⅠ", 357, 3],
    ["猫まんまⅡ", 358, 4],
    ["猫まんまⅢ", 359, 5],
    ["猫の神", 360, 10],
    ["獅子跳躍爪", 364, 10],
    ["獣神爪牙", 365, 12],

    // 魔法(光)
    ["ファストマジック(光)", 202, 0],
    ["セイントⅠ", 203, 3],
    ["セイントⅡ", 204, 4],
    ["セイントⅢ", 205, 5],
    ["ヒールⅠ", 262, 0],
    ["ヒールⅡ", 263, 3],
    ["ヒールⅢ", 264, 4],
    ["グレイスヒール", 265, 4],
    ["セイクリッドヒールⅠ", 266, 3],
    ["セイクリッドヒールⅡ", 267, 4],
    ["リバース", 268, 5],
    ["エクソシズムⅠ", 271, 3],
    ["エクソシズムⅡ", 272, 4],
    ["エクソシズムⅢ", 273, 5],
    ["サンクチュアリⅠ", 269, 3],
    ["サンクチュアリⅡ", 270, 4],
    ["神命Ⅰ", 277, 3],
    ["神命Ⅱ", 278, 4],
    ["神命Ⅲ", 279, 5],
    ["聖光の僧侶", 280, 10],
    ["ディバインヒール", 284, 10],
    ["エターナルリバース", 285, 12],
],

// スキルツリーの派生設定を行います。
// skillTreeDerivative: { ～ }の中にタイプ数分のスキルツリーの登録を行います。

// スキルツリーの派生設定は次のように行います。
// "タイプ名": [ [スキル1, [派生先スキル1, 派生先スキル2, ...]], [スキル2, [派生先スキル3, 派生先スキル4, ...] ]
// ※派生先スキルが存在しない終端スキルの場合、派生先スキルは省略可能です。
//
// 例えば、"様子を見る"と"連続攻撃"を取得すると、"２回攻撃"が取得できるようにするには、次の設定を行います。
// ["様子を見る", ["２回攻撃"]],
// ["連続攻撃", ["２回攻撃"]],
// ["２回攻撃"],
//
// また、"ヒール"を取得すると、"ファイア"と"スパーク"が取得できるようにするには、次の設定を行います。
// ["ヒール", ["ファイア"]],
// ["ヒール", ["スパーク"]],
// ["ファイア"],
// ["スパーク"],
skillTreeDerivative: {
    "魔法(炎)": [
        ["ファストマジック(炎)", ["ファイアⅠ", "フレイムサイクロンⅠ", "ブレイズⅠ", "バーンⅠ", "ヒートアップⅠ", "火魔女Ⅰ"]],
        ["ファイアⅠ", ["ファイアⅡ"]],
        ["ファイアⅡ", ["ファイアⅢ"]],
        ["フレイムサイクロンⅠ", ["フレイムサイクロンⅡ"]],
        ["ブレイズⅠ", ["ブレイズⅡ"]],
        ["ブレイズⅡ", ["ブレイズⅢ"]],
        ["バーンⅠ", ["バーンⅡ"]],
        ["バーンⅡ", ["バーンⅢ"]],
        ["ヒートアップⅠ", ["ヒートアップⅡ"]],
        ["ヒートアップⅡ", ["ヒートアップⅢ"]],
        ["火魔女Ⅰ", ["火魔女Ⅱ"]],
        ["火魔女Ⅱ", ["火魔女Ⅲ"]],
        ["ファイアⅢ", ["メテオインパクト"]],
        ["フレイムサイクロンⅡ", ["メテオインパクト"]],
        ["ブレイズⅢ", ["メテオインパクト"]],
        ["バーンⅢ", ["炎の魔女"]],
        ["ヒートアップⅢ", ["炎の魔女"]],
        ["火魔女Ⅲ", ["炎の魔女"]],
        ["メテオインパクト", ["カオスインフェルノ"]],
        ["炎の魔女", ["カオスインフェルノ"]],
        ["カオスインフェルノ"],
    ],

    "魔法(風)": [
        ["ファストマジック(風)", ["ウィンドⅠ", "エアスラッシュⅠ", "エアリアルダンス", "ストームⅠ", "アースシールドⅠ", "鉄の処女Ⅰ"]],
        ["ウィンドⅠ", ["ウィンドⅡ"]],
        ["ウィンドⅡ", ["ウィンドⅢ"]],
        ["エアスラッシュⅠ", ["エアスラッシュⅡ"]],
        ["エアリアルダンス", ["ウィンドブースト"]],
        ["ストームⅠ", ["ストームⅡ"]],
        ["ストームⅡ", ["ストームⅢ"]],
        ["アースシールドⅠ", ["アースシールドⅡ"]],
        ["アースシールドⅡ", ["アースシールドⅢ"]],
        ["アースシールドⅢ", ["ストーンウォール"]],
        ["鉄の処女Ⅰ", ["鉄の処女Ⅱ"]],
        ["鉄の処女Ⅱ", ["鉄の処女Ⅲ"]],
        ["ウィンドⅢ", ["サイクロン"]],
        ["エアスラッシュⅡ", ["サイクロン"]],
        ["ウィンドブースト", ["壁の魔女"]],
        ["ストームⅢ", ["サイクロン"]],
        ["ストーンウォール", ["壁の魔女"]],
        ["鉄の処女Ⅲ", ["壁の魔女"]],
        ["サイクロン", ["テンペスト"]],
        ["壁の魔女", ["テンペスト"]],
        ["テンペスト"],
    ],

    "魔法(氷)": [
        ["ファストマジック(氷)", ["アイスⅠ", "ブリザードⅠ", "ダイヤモンドダストⅠ", "アイスフィールドⅠ", "フロスト", "氷魔の印Ⅰ"]],
        ["アイスⅠ", ["アイスⅡ"]],
        ["アイスⅡ", ["アイスⅢ"]],
        ["ブリザードⅠ", ["ブリザードⅡ"]],
        ["ブリザードⅡ", ["ブリザードⅢ"]],
        ["ダイヤモンドダストⅠ", ["ダイヤモンドダストⅡ"]],
        ["ダイヤモンドダストⅡ", ["ダイヤモンドダストⅢ"]],
        ["アイスフィールドⅠ", ["アイスフィールドⅡ"]],
        ["アイスフィールドⅡ", ["アイスフィールドⅢ"]],
        ["フロスト", ["アイスミラー"]],
        ["氷魔の印Ⅰ", ["氷魔の印Ⅱ"]],
        ["氷魔の印Ⅱ", ["氷魔の印Ⅲ"]],
        ["アイスⅢ", ["ブリザードストーム"]],
        ["ブリザードⅢ", ["ブリザードストーム"]],
        ["ダイヤモンドダストⅢ", ["ブリザードストーム"]],
        ["アイスフィールドⅢ", ["氷の魔女"]],
        ["アイスミラー", ["氷の魔女"]],
        ["氷魔の印Ⅲ", ["氷の魔女"]],
        ["ブリザードストーム", ["アブソリュートゼロ"]],
        ["氷の魔女", ["アブソリュートゼロ"]],
        ["アブソリュートゼロ"],
    ],

    "格闘": [
        ["体当たり", ["ひっかくⅠ", "猛猫乱舞Ⅰ", "気合いⅠ", "とっしんⅠ", "一喝", "猫まんまⅠ"]],
        ["ひっかくⅠ", ["ひっかくⅡ"]],
        ["ひっかくⅡ", ["ひっかくⅢ"]],
        ["猛猫乱舞Ⅰ", ["猛猫乱舞Ⅱ"]],
        ["猛猫乱舞Ⅱ", ["猛猫乱舞Ⅲ"]],
        ["気合いⅠ", ["気合いⅡ"]],
        ["気合いⅡ", ["闘志"]],
        ["とっしんⅠ", ["とっしんⅡ"]],
        ["とっしんⅡ", ["とっしんⅢ"]],
        ["一喝", ["かばう"]],
        ["猫まんまⅠ", ["猫まんまⅡ"]],
        ["猫まんまⅡ", ["猫まんまⅢ"]],
        ["ひっかくⅢ", ["獅子跳躍爪"]],
        ["猛猫乱舞Ⅲ", ["獅子跳躍爪"]],
        ["闘志", ["猫の神"]],
        ["とっしんⅢ", ["獅子跳躍爪"]],
        ["かばう", ["猫の神"]],
        ["猫まんまⅢ", ["猫の神"]],
        ["獅子跳躍爪", ["獣神爪牙"]],
        ["猫の神", ["獣神爪牙"]],
        ["獣神爪牙"],
    ],

    "魔法(光)": [
        ["ファストマジック(光)", ["セイントⅠ"]],
        ["セイントⅠ", ["セイントⅡ"]],
        ["セイントⅡ", ["セイントⅢ"]],
        ["セイントⅢ"],
        ["ヒールⅠ", ["ヒールⅡ", "セイクリッドヒールⅠ", "エクソシズムⅠ", "サンクチュアリⅠ", "神命Ⅰ"]],
        ["ヒールⅡ", ["ヒールⅢ"]],
        ["ヒールⅢ", ["グレイスヒール"]],
        ["セイクリッドヒールⅠ", ["セイクリッドヒールⅡ"]],
        ["セイクリッドヒールⅡ", ["リバース"]],
        ["エクソシズムⅠ", ["エクソシズムⅡ"]],
        ["エクソシズムⅡ", ["エクソシズムⅢ"]],
        ["サンクチュアリⅠ", ["サンクチュアリⅡ"]],
        ["神命Ⅰ", ["神命Ⅱ"]],
        ["神命Ⅱ", ["神命Ⅲ"]],
        ["グレイスヒール", ["ディバインヒール"]],
        ["リバース", ["ディバインヒール"]],
        ["エクソシズムⅢ", ["聖光の僧侶"]],
        ["サンクチュアリⅡ", ["ディバインヒール"]],
        ["神命Ⅲ", ["聖光の僧侶"]],
        ["聖光の僧侶", ["エターナルリバース"]],
        ["ディバインヒール", ["エターナルリバース"]],
        ["エターナルリバース"],
    ],
},

// レベルアップによってSPを獲得する場合、レベルごとに得られるSP値を以下の形式で設定します。
// classId: 職業ID, default: デフォルト値, レベル: SP値, レベル: SP値, ...
// 下記の設定例では、レベル2では3SP取得、レベル3では4SP取得、それ以外のレベルでは5SPを獲得します。
levelUpGainSp: [
    {
        classId: 2,
        default: 2,
    },

    {
        classId: 3,
        default: 2,
    },

    {
        classId: 4,
        default: 2,
    },

    {
        classId: 5,
        default: 2,
    },

    {
        classId: 6,
        default: 2,
    },
]
// =============================================================
// ●設定項目はここまでです。
// =============================================================
};
};
